apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_adi3_refsys.h
/* TIVA_ADI3_REFSYS_ATESTCTL1 */

#define ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_SHIFT                (0)       /* Bits 0-2 */
#define ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_MASK                 (7 << ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_SHIFT)
#  define ADI3_REFSYS_ATESTCTL1_ATEST1_CTL(n)                 ((uint32_t)(n) << ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_SHIFT)
#  define ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_NC                 (0 << ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_SHIFT)
#  define ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_VREAD_DIV2_A1      (1 << ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_SHIFT)
#  define ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_VPP_DIV5_A1        (2 << ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_SHIFT)
#  define ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_VREFM_A1           (4 << ADI3_REFSYS_ATESTCTL1_ATEST1_CTL_SHIFT)
#define ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_SHIFT                (3)       /* Bits 3-4 */
#define ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_MASK                 (3 << ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_SHIFT)
#  define ADI3_REFSYS_ATESTCTL1_ATEST0_CTL(n)                 ((uint32_t)(n) << ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_SHIFT)
#  define ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_NC                 (0 << ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_SHIFT))
#  define ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_IREF_A0            (1 << ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_SHIFT))
#  define ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_ICELL_A0           (2 << ADI3_REFSYS_ATESTCTL1_ATEST0_CTL_SHIFT))

/* TIVA_ADI3_REFSYS_REFSYSCTL0 */

#define ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT                  (0)       /* Bits 0-7 */
#define ADI3_REFSYS_REFSYSCTL0_TESTCTL_MASK                   (0xff << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL(n)                   ((uint32_t)(n) << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_NC                   (0x00 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_IPTAT2U              (0x01 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_IVREF4U              (0x02 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_IREF4U               (0x04 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_VBG                  (0x08 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_VBGUNBUFF            (0x10 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_VREF0P8V             (0x20 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_VTEMP                (0x40 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL0_TESTCTL_BMCOMPOUT            (0x80 << ADI3_REFSYS_REFSYSCTL0_TESTCTL_SHIFT)

/* TIVA_ADI3_REFSYS_REFSYSCTL1 */

#define ADI3_REFSYS_REFSYSCTL1_TESTCTL_SHIFT                  (0)       /* Bits 0-1 */
#define ADI3_REFSYS_REFSYSCTL1_TESTCTL_MASK                   (3 << ADI3_REFSYS_REFSYSCTL1_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TESTCTL(n)                   ((uint32_t)(n) << ADI3_REFSYS_REFSYSCTL1_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TESTCTL_NC                   (0 << ADI3_REFSYS_REFSYSCTL1_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TESTCTL_BMCOMPIN             (1 << ADI3_REFSYS_REFSYSCTL1_TESTCTL_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TESTCTL_IPTAT1U              (2 << ADI3_REFSYS_REFSYSCTL1_TESTCTL_SHIFT)
#define ADI3_REFSYS_REFSYSCTL1_BATMON_COMP_TEST_EN            (1 << 2)  /* Bit 2 */
#define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT            (3)       /* Bits 3-7 */
#define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_MASK             (31 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD(n)             ((uint32_t)(n) << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_4          (0 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_5          (1 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_6          (2 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_7          (3 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_0          (4 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_1          (5 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_2          (6 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_3          (7 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_12         (8 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_13         (9 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_14         (10 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_15         (11 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_8          (12 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_9          (13 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_10         (14 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_11         (15 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_20         (16 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_21         (17 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_22         (18 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_23         (19 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_16         (20 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_17         (21 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_18         (22 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_19         (23 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_28         (24 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_29         (25 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_30         (26 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_31         (27 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_24         (28 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_25         (29 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_26         (30 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)
#  define ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_POS_27         (31 << ADI3_REFSYS_REFSYSCTL1_TRIM_VDDS_BOD_SHIFT)

/* TIVA_ADI3_REFSYS_REFSYSCTL2 */

