apache/nuttx/arch/arm/src/tiva/hardware/cc13x2_cc26x2/cc13x2_cc26x2_adi3_refsys.h
/* TIVA_ADI3_REFSYS_DCDCCTL4 */

#define ADI3_REFSYS_DCDCCTL4_HIGH_EN_SEL_SHIFT                (0)       /* Bits 0-2 */
#define ADI3_REFSYS_DCDCCTL4_HIGH_EN_SEL_MASK                 (7 << ADI3_REFSYS_DCDCCTL4_HIGH_EN_SEL_SHIFT)
#  define ADI3_REFSYS_DCDCCTL4_HIGH_EN_SEL(n)                 ((uint32_t)(n) << ADI3_REFSYS_DCDCCTL4_HIGH_EN_SEL_SHIFT)
#define ADI3_REFSYS_DCDCCTL4_LOW_EN_SEL_SHIFT                 (3)       /* Bits 3-5 */
#define ADI3_REFSYS_DCDCCTL4_LOW_EN_SEL_MASK                  (7 << ADI3_REFSYS_DCDCCTL4_LOW_EN_SEL_SHIFT)
#  define ADI3_REFSYS_DCDCCTL4_LOW_EN_SEL(n)                  ((uint32_t)(n) << ADI3_REFSYS_DCDCCTL4_LOW_EN_SEL_SHIFT)
#define ADI3_REFSYS_DCDCCTL4_DEADTIME_TRIM_SHIFT              (6)       /* Bits 6-7 */
#define ADI3_REFSYS_DCDCCTL4_DEADTIME_TRIM_MASK               (3 << ADI3_REFSYS_DCDCCTL4_DEADTIME_TRIM_SHIFT)
#  define ADI3_REFSYS_DCDCCTL4_DEADTIME_TRIM(n)               ((uint32_t)(n) << ADI3_REFSYS_DCDCCTL4_DEADTIME_TRIM_SHIFT)

/* TIVA_ADI3_REFSYS_DCDCCTL5 */

#define ADI3_REFSYS_DCDCCTL5_IPEAK_SHIFT                      (0)       /* Bits 0-2 */
#define ADI3_REFSYS_DCDCCTL5_IPEAK_MASK                       (7 << ADI3_REFSYS_DCDCCTL5_IPEAK_SHIFT)
#  define ADI3_REFSYS_DCDCCTL5_IPEAK(n)                       ((uint32_t)(n) << ADI3_REFSYS_DCDCCTL5_IPEAK_SHIFT)
#define ADI3_REFSYS_DCDCCTL5_DITHER_EN                        (1 << 3)  /* Bit 3 */
#define ADI3_REFSYS_DCDCCTL5_TESTP                            (1 << 4)  /* Bit 4 */
#define ADI3_REFSYS_DCDCCTL5_TESTN                            (1 << 5)  /* Bit 5 */

/* ADI_3_REFSYS_AUX_DEBUG */

#define ADI3_REFSYS_AUX_DEBUG_DAC_DBG_EN                      (1 << 0)  /* Bit 0:  Enable Debug Mode */
#define ADI3_REFSYS_AUX_DEBUG_DAC_DBG_SAMPLE                  (1 << 1)  /* Bit 1:  S-H Cap sample signal */
#define ADI3_REFSYS_AUX_DEBUG_DAC_DBG_CAP_SAMPLE              (1 << 2)  /* Bit 2: Cap-array sample signal */
#define ADI3_REFSYS_AUX_DEBUG_DAC_DBG_PRECHARGE               (1 << 3)  /* Bit 3:  PRE-CHARGE signal */
#define ADI3_REFSYS_AUX_DEBUG_DAC_DBG_HOLD                    (1 << 4)  /* Bit 4:  S-H Cap hold signal */
#define ADI3_REFSYS_AUX_DEBUG_DAC_DBG_OFFSET_COMP             (1 << 5)  /* Bit 5:  Offset compensation signal */
#define ADI3_REFSYS_AUX_DEBUG_LPM_BIAS_BACKUP_EN              (1 << 6)  /* Bit 6:   Activate the backup circuit */

/* TIVA_ADI3_REFSYS_CTL_RECHARGE_CMP0 */

#define ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_SHIFT    (0)       /* Bits 0-3: Trim ref level of recharge */
#define ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_MASK     (15 << ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_SHIFT)
#  define ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL(n)     ((uint32_t)(n) << ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_SHIFT)
#  define ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_90PCT  (15 << ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_SHIFT)
#  define ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_100PCT (0 << ADI3_REFSYS_CTL_RECHARGE_CMP0_TRIM_RECHARGE_COMP_REFLEVEL_SHIFT)
#define ADI3_REFSYS_CTL_RECHARGE_CMP0_COMP_CLK_DISABLE                     (1 << 4) /* Bit 4:  Enable 32 kHz SCLK_LF to recharge comparator */

/* TIVA_ADI3_REFSYS_CTL_RECHARGE_CMP1 */

#define ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_SHIFT   (0)       /* Bis 0-4: Trim offset of Recharge comparator */
#define ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_MASK    (31 << ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_SHIFT)
#  define ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET(n)    ((uint32_t)(n) << ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_SHIFT)
#define ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_MAXIN   (0 << ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_SHIFT) /* Maximum degeneration on input side (VDDR side) */
#define ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_MAXREF  (31 << ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_SHIFT) /* Maximum degeneration on reference side from cap divider */
#define ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_NOMINAL (16 << ADI3_REFSYS_CTL_RECHARGE_CMP1_TRIM_RECHARGE_COMP_OFFSET_SHIFT) /* Nominal code */
#define ADI3_REFSYS_CTL_RECHARGE_CMP1_FORCE_SAMPLE_VDDR                 (1 << 5)  /* Bit 5:  Force Sample of VDDR on cap divider */
#define ADI3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_ATEST_EN           (1 << 6)  /* Bit 6:  Enable test inputs/outputs to recharge comparator */
#define ADI3_REFSYS_CTL_RECHARGE_CMP1_RECHARGE_BLOCK_VTRIG_EN           (1 << 7)  /* Bit 7: Enable ATEST input to VDDR input of recharge comparator */

#endif /* __ARCH_ARM_SRC_TIVA_HARDWARE_CC13X2_CC26X2_CC13X2_CC26X2_ADI3_REFSYS_H */
